Revit 2024 API
ParameterTypeId.BentFabricParamStraightWiresLocation Property
 "Straight Wires Location": Location of straight wires in a bent fabric.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId BentFabricParamStraightWiresLocation { get; }
Visual Basic
Public Shared ReadOnly Property BentFabricParamStraightWiresLocation As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ BentFabricParamStraightWiresLocation {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace